/**********************************************************************************************************
**@题目:一元多项式求和
**@输入:3x^3+2x^2+1x^1+1
***     2
**@输出:35
**********************************************************************************************************/
#include <stdio.h>
#include <iso646.h>
#include <math.h>
#include <string.h>

int main(int argc, char *argv[])
{
    char s[2][100];
    for(int x, y, i, j, sum1; sum1 = argc - 1, scanf("%s%*c%d", s[0], &x) not_eq EOF; printf("%d\n", sum1)) {
        i = strlen(s[0]);
        while(i) sum1 += (s[0][i - 1] == 43 and s[0][i + 1] == 0) ? s[0][i] - 48 : (s[0][i] == 120) ? (s[0][i - 1] - 48) * pow(x, s[0][i + 2] - 48) : 0, i--;
    }
    return 0;
}
